# Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
# Петя помогает Кате по математике. Он задумывает два натуральных числа X и Y (X,Y≤1000),
# а Катя должна их отгадать. Для этого Петя делает две подсказки.
# Он называет сумму этих чисел S и их произведение P.
# Помогите Кате отгадать задуманные Петей числа.
# *Пример:
# 4 4 -> 2 2
# 5 6 -> 2 *


#
# numbers_summ = int(input('Введите сумму искомых чисел:'))
# numbers_mult = int(input('Введите произведение искомых чисел:'))
#
# for i in range(0, 1001, 1):
#     for k in range(0, 1001, 1):
#      if i + k == numbers_summ and i * k == numbers_mult:
#             print(f'Искомая пара чисел: {i}, {k}')
#             quit()
#
#
# else:
#   print('Такой пары чисел не существует!')

